TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_fri.h
/* FRI_DTB_MUXSEL Bits */
/* FRI_DTB_MUXSEL[DTB_MUX_SEL_FRI] Bits */
#define FRI_DTB_MUXSEL_DTB_MUX_SEL_FRI_OFS       (0)                             /* !< DTB_MUX_SEL_FRI Offset */
#define FRI_DTB_MUXSEL_DTB_MUX_SEL_FRI_MASK      ((uint32_t)0x00000003U)         /* !< DTB Mux Select for Flash read
                                                                                    interface signals to be exported out
                                                                                    on DTB bus. Based on the MUXSELECT
                                                                                    value, corresponding banks' DTB
                                                                                    signals will be exported out. #br#00
                                                                                    - Bank0 #br#01 - Bank1 #br#10 - Bank2
                                                                                    #br#11 - Reserved */

/* FRI_DTB_MUXSEL_1 Bits */
/* FRI_DTB_MUXSEL_1[DTB_MUX_SEL_FRI] Bits */
#define FRI_DTB_MUXSEL_1_DTB_MUX_SEL_FRI_OFS     (0)                             /* !< DTB_MUX_SEL_FRI Offset */
#define FRI_DTB_MUXSEL_1_DTB_MUX_SEL_FRI_MASK    ((uint32_t)0x00000003U)         /* !< DTB Mux Select for Flash read
                                                                                    interface signals to be exported out
                                                                                    on DTB bus. Based on the MUXSELECT
                                                                                    value, corresponding banks' DTB
                                                                                    signals will be exported out. #br#00
                                                                                    - Bank0 #br#01 - Bank1 #br#10 - Bank2
                                                                                    #br#11 - Reserved */

/* FRI_ECC_ENABLE Bits */
/* FRI_ECC_ENABLE[ENABLE] Bits */
#define FRI_ECC_ENABLE_ENABLE_OFS                (0)                             /* !< ENABLE Offset */
#define FRI_ECC_ENABLE_ENABLE_MASK               ((uint32_t)0x0000000FU)         /* !< ECC enable. A value of 0xA would
                                                                                    enable ECC. Any other value would
                                                                                    disable ECC. */

/* FRI_FECC_CTRL_TOPOARIA Bits */
/* FRI_FECC_CTRL_TOPOARIA[ECC_TEST_EN] Bits */
#define FRI_FECC_CTRL_TOPOARIA_ECC_TEST_EN_OFS   (0)                             /* !< ECC_TEST_EN Offset */
#define FRI_FECC_CTRL_TOPOARIA_ECC_TEST_EN_MASK  ((uint32_t)0x00000003U)         /* !< ECC test mode enable. #br#00 ECC
                                                                                    test mode disabled #br#01 ECC test
                                                                                    mode enabled, one of the 64 data bits
                                                                                    is flipped and fed to the redundant
                                                                                    ECC logic (on both ECC logic low and
                                                                                    ECC logc high blocks). #br#11 ECC
                                                                                    test mode enabled, Two of the 64 data
                                                                                    bits are flipped and fed to the
                                                                                    redundant ECC logic (on both ECC
                                                                                    logic low and ECC logc high blocks).
                                                                                    #br#10 Reserved */

/* FRI_FECC_CTRL_1 Bits */
/* FRI_FECC_CTRL_1[ECC_TEST_EN] Bits */
#define FRI_FECC_CTRL_1_ECC_TEST_EN_OFS          (0)                             /* !< ECC_TEST_EN Offset */
#define FRI_FECC_CTRL_1_ECC_TEST_EN_MASK         ((uint32_t)0x00000003U)         /* !< ECC test mode enable. #br#00 ECC
                                                                                    test mode disabled #br#01 ECC test
                                                                                    mode enabled, one of the 64 data bits
                                                                                    is flipped and fed to the redundant
                                                                                    ECC logic (on both ECC logic low and
                                                                                    ECC logc high blocks). #br#11 ECC
                                                                                    test mode enabled, Two of the 64 data
                                                                                    bits are flipped and fed to the
                                                                                    redundant ECC logic (on both ECC
                                                                                    logic low and ECC logc high blocks).
                                                                                    #br#10 Reserved */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_fri__include */

